
<!DOCTYPE HTML>
<html lang="tr" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Görünüşü Güzelleştirelim · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Buğra İŞGÜZAR ben@bisguzar.com">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="retouch.html" />
    
    
    <link rel="prev" href="prepare_html.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Aramak istediğiniz" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Giriş
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../1-how_internet_works/content.html">
            
                <a href="../1-how_internet_works/content.html">
            
                    
                    İnternet Nasıl Çalışır
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../2-about_html/summary.html">
            
                <a href="../2-about_html/summary.html">
            
                    
                    HTML'e Giriş
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../2-about_html/tags.html">
            
                <a href="../2-about_html/tags.html">
            
                    
                    Temel Etiketler
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../2-about_html/tags2.html">
            
                <a href="../2-about_html/tags2.html">
            
                    
                    Derinlere İnelim
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../3-about_css.html">
            
                <a href="../3-about_css.html">
            
                    
                    CSS'e Giriş
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="begin.html">
            
                <a href="begin.html">
            
                    
                    Başlayalım
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="prepare_html.html">
            
                <a href="prepare_html.html">
            
                    
                    HTML'i Hazırlayalım
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5.2" data-path="beautify_html.html">
            
                <a href="beautify_html.html">
            
                    
                    Görünüşü Güzelleştirelim
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="retouch.html">
            
                <a href="retouch.html">
            
                    
                    Son Dokunuşlar
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../5-deployment.html">
            
                <a href="../5-deployment.html">
            
                    
                    Sayfamızı Yayınlayalım
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            GitBook ile yayınla
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Görünüşü Güzelleştirelim</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="g&#xF6;r&#xFC;n&#xFC;&#x15F;&#xFC;-g&#xFC;zelle&#x15F;tirelim">G&#xF6;r&#xFC;n&#xFC;&#x15F;&#xFC; G&#xFC;zelle&#x15F;tirelim</h1>
<p>&#x15E;u andan itibaren daha &#xE7;ok haz&#x131;rlad&#x131;&#x11F;&#x131;m&#x131;z sayfam&#x131;z&#x131;n g&#xF6;r&#xFC;n&#xFC;&#x15F;&#xFC;n&#xFC; g&#xFC;n&#xFC;m&#xFC;z tasar&#x131;m anlay&#x131;&#x15F;&#x131;na g&#xF6;re &#x15F;ekillendirece&#x11F;iz. Bu sayfay&#x131; tek ba&#x15F;l&#x131;k alt&#x131;nda haz&#x131;rlad&#x131;&#x11F;&#x131;m&#x131;z i&#xE7;in anlam karma&#x15F;as&#x131; ya&#x15F;ayabilirsiniz. Bu gibi durumlarda ment&#xF6;r&#xFC;n&#xFC;zden destek istemekten &#xE7;ekinmeyin. Dolay&#x131;s&#x131;yla yazd&#x131;&#x11F;&#x131;m&#x131;z her ufak kod sayfan&#x131;n g&#xF6;r&#xFC;n&#xFC;&#x15F;&#xFC;nde farkl&#x131;l&#x131;k yaratacak. Bu farkl&#x131;l&#x131;klar&#x131; canl&#x131; &#x15F;ekilde takip edebilmek i&#xE7;in <em>index.html</em> sayfas&#x131;n&#x131; taray&#x131;c&#x131; ile a&#xE7;al&#x131;m ve a&#xE7;&#x131;k kals&#x131;n. Bu b&#xF6;l&#xFC;m&#xFC;n ilerleyen noktalar&#x131;nda taray&#x131;c&#x131;ya geri d&#xF6;n&#xFC;p sayfay&#x131; yenileyece&#x11F;iz ve yapt&#x131;&#x11F;&#x131;m&#x131;z de&#x11F;i&#x15F;iklikleri g&#xF6;zlemleyebilece&#x11F;iz. Yazd&#x131;&#x11F;&#x131;m&#x131;z CSS kodlar&#x131;n&#x131;n kar&#x15F;&#x131;l&#x131;&#x11F;&#x131;n&#x131; somut olarak an&#x131;nda g&#xF6;rd&#xFC;&#x11F;&#xFC;m&#xFC;z zaman kal&#x131;c&#x131;l&#x131;&#x11F;&#x131; da artacakt&#x131;r. Bu b&#xF6;l&#xFC;mde yapaca&#x11F;&#x131;m&#x131;z t&#xFC;m i&#x15F;lemleri <em>style.css</em> dosyam&#x131;z &#xFC;zerinde yapaca&#x11F;&#x131;z. Dolay&#x131;s&#x131;yla dosyam&#x131;z&#x131; kod edit&#xF6;r&#xFC;m&#xFC;z ile a&#xE7;al&#x131;m.</p>
<p>&#xD6;ncelikle sayfam&#x131;z&#x131;n genel g&#xF6;r&#xFC;nt&#xFC;s&#xFC;n&#xFC; d&#xFC;zenleyerek ba&#x15F;layal&#x131;m. Web siteleri de bir kompozisyondan olu&#x15F;ur. Ve bu kompozisyonu d&#xF6;nemin trendleri belirler. Modern herhangi bir web sitesine girdi&#x11F;iniz zaman ana i&#xE7;eri&#x11F;in sayfan&#x131;n orta taraflar&#x131;na do&#x11F;ru konumland&#x131;r&#x131;ld&#x131;&#x11F;&#x131;n&#x131; g&#xF6;rebilirsiniz. Biz de sayfam&#x131;z&#x131;n i&#xE7;eri&#x11F;ini ortalayal&#x131;m ve okunabilirli&#x11F;i artt&#x131;ral&#x131;m. Bunun i&#xE7;in se&#xE7;icisi <em>body</em> etiketi olan bir css kodu haz&#x131;rlayal&#x131;m.</p>
<pre><code class="lang-css"><span class="hljs-selector-tag">body</span> {

}
</code></pre>
<p>&#x130;lk olarak kullanaca&#x11F;&#x131;m&#x131;z &#xF6;zelli&#x11F;imiz <em>margin</em> &#xF6;zelli&#x11F;i. Margin &#xF6;zelli&#x11F;i ilgili eleman&#x131;n d&#x131;&#x15F; k&#x131;s&#x131;mlar&#x131;ndan ne kadar &#xF6;telenece&#x11F;ini belirlemek i&#xE7;in kullan&#x131;l&#x131;yor. Biz &#x15F;imdi de&#x11F;eri <em>0 auto</em> olan bir <em>margin</em> &#xF6;zelli&#x11F;i ekleyelim bu kodumuza.</p>
<pre><code class="lang-css"><span class="hljs-selector-tag">body</span> {
    <span class="hljs-attribute">margin</span>: <span class="hljs-number">0</span> auto;
    <span class="hljs-attribute">max-width</span>: <span class="hljs-number">50em</span>;
}
</code></pre>
<p>Dosyay&#x131; kaydettikten sonra taray&#x131;c&#x131;m&#x131;za ge&#xE7;ip <em>index.html</em> dosyas&#x131;n&#x131; yenilersek &#xFC;st-alt ve yanlardan biraz bo&#x15F;luk olu&#x15F;tu&#x11F;unu ve i&#xE7;eri&#x11F;imizin ortaland&#x131;&#x11F;&#x131;n&#x131; g&#xF6;rebiliriz. Burada <em>margin</em> &#xF6;zelli&#x11F;ine de&#x11F;er olarak asl&#x131;nda iki farkl&#x131; de&#x11F;er verdik. Bu de&#x11F;erlerden ilki olan <em>0</em> de&#x11F;eri eleman&#x131;n &#xFC;st ve alttan ne kadar &#xF6;telenece&#x11F;ini ifade ediyor. 2. de&#x11F;er olan <em>auto</em> ise sol ve sa&#x11F; d&#x131;&#x15F;tan ne kadar &#xF6;telenece&#x11F;ini belirtiyor. Bunlar&#x131;n yan&#x131;nda bir de <em>max-width</em> &#xF6;zelli&#x11F;ini <em>50em</em> olarak ayarlad&#x131;k g&#xF6;rd&#xFC;&#x11F;&#xFC;n&#xFC;z gibi. Bunun sebebi ise geni&#x15F;li&#x11F;i belli olmayan b&#xF6;lme/div (body etiketini de bir b&#xF6;lme/div olarak d&#xFC;&#x15F;&#xFC;nebilirsiniz) asl&#x131;nda geni&#x15F;lik olarak ekran&#x131;n alabildi&#x11F;i kadar geni&#x15F;tir. Dolay&#x131;s&#x131;yla biz geni&#x15F;li&#x11F;in tamam&#x131;n&#x131; kaplayan bir eleman&#x131; yanlardan &#xF6;teleyemeyiz &#xE7;&#xFC;nk&#xFC; &#xF6;telenebilecek bo&#x15F; bir de&#x11F;er yok. De&#x11F;er olarak verdi&#x11F;imiz <em>50em</em> ise bir &#xF6;l&#xE7;&#xFC; birimi. CSS stilleme dilinde <em>em</em> &#xF6;l&#xE7;&#xFC; birimi asl&#x131;nda mevcut yaz&#x131; fontunun ka&#xE7; kat&#x131; olaca&#x11F;&#x131;n&#x131; belirtiyor. &#xD6;rne&#x11F;in <strong>2em = 2*yaz&#x131; fontu</strong>.</p>
<p>&#xD6;rneklendirelim bu konuyu. Ekran geni&#x15F;li&#x11F;imizin 100em oldu&#x11F;unu d&#xFC;&#x15F;&#xFC;nelim. Bunun 50em&apos;lik k&#x131;s&#x131;m&#x131;n&#x131; bizim body etiketimiz kullanacak. geriye 50em kalacak. Bu etiket de sa&#x11F; ve soldan otomatik olarak &#xF6;telenece&#x11F;i i&#xE7;in soldan <em>25em</em> sa&#x11F;dan da <em>25em</em> &#xF6;telenecek ve ortalanacak demektir.</p>
<p>Taray&#x131;c&#x131;da canl&#x131; olarak da g&#xF6;rebildi&#x11F;imiz gibi i&#xE7;eri&#x11F;imiz yanlardan ortaland&#x131; ancak &#xFC;st ve alttan h&#xE2;l&#xE2; s&#x131;n&#x131;rlara dayal&#x131;. Bu sefer &#xFC;st ve alttan &#xF6;teleme i&#xE7;in margin etiketini de&#x11F;il de <em>padding</em> etiketini kullanal&#x131;m. Margin etiketinin o eleman&#x131;n d&#x131;&#x15F;tan &#xF6;telenmesini sa&#x11F;lad&#x131;&#x11F;&#x131;ndan bahsetmi&#x15F;tik. <em>padding</em> etiketi ise eleman&#x131;n i&#xE7;ten &#xF6;telenmesini sa&#x11F;l&#x131;yor. </p>
<p><img src="../0-static/marginandpadding.gif" alt="marginandpadding"></p>
<p>Bu g&#xF6;rselde ye&#x15F;il alan HTML eleman&#x131;n&#x131; temsil ediyor. Yani bizim senaryomuzda <em>body</em> etiketini. &#x15E;imdi de <em>body</em> se&#xE7;icimize yazd&#x131;&#x11F;&#x131;m&#x131;z &#xF6;zelliklere bir de <em>padding</em> &#xF6;zelli&#x11F;ini ekleyelim ve de&#x11F;erini de <em>4em 1em</em> yapal&#x131;m. Bunlar da s&#x131;ras&#x131;yla &#xFC;st-alt ve sol-sa&#x11F; i&#xE7;e &#xF6;telemelerini temsil ediyor.</p>
<pre><code class="lang-css"><span class="hljs-selector-tag">body</span> {
    <span class="hljs-attribute">margin</span>: <span class="hljs-number">0</span> auto;
    <span class="hljs-attribute">max-width</span>: <span class="hljs-number">50em</span>;
    <span class="hljs-attribute">padding</span>: <span class="hljs-number">4em</span> <span class="hljs-number">1em</span>;
}
</code></pre>
<p>&#x15E;u anda kodumuzun son hali yukar&#x131;daki gibi. Ve taray&#x131;c&#x131;ya ge&#xE7;ip sayfay&#x131; yeniledi&#x11F;imizde istedi&#x11F;imiz her &#x15F;eyin oldu&#x11F;unu g&#xF6;rebiliyoruz. Biraz da yaz&#x131;lar&#x131; okunabilir k&#x131;lal&#x131;m. &#xC7;&#xFC;nk&#xFC; sayfam&#x131;z&#x131;n genel yap&#x131;s&#x131; art&#x131;k g&#xF6;ze daha fazla hitap ediyor ancak yaz&#x131;lar g&#xFC;n&#xFC;m&#xFC;z standartlar&#x131;na pek de uymuyor. Bunun i&#xE7;in a&#x15F;a&#x11F;&#x131;daki kodlar&#x131; da yine ayn&#x131; se&#xE7;icimizin &#xF6;zellikleri aras&#x131;na ekleyelim.</p>
<pre><code class="lang-css"><span class="hljs-selector-tag">font-family</span>: &quot;<span class="hljs-selector-tag">Helvetica</span>&quot;, &quot;<span class="hljs-selector-tag">Arial</span>&quot;, <span class="hljs-selector-tag">sans-serif</span>;
<span class="hljs-selector-tag">line-height</span>: 1<span class="hljs-selector-class">.5</span>;
<span class="hljs-selector-tag">color</span>: <span class="hljs-selector-id">#555</span>;
</code></pre>
<p>Bu kodlar&#x131; s&#x131;ras&#x131;yla a&#xE7;&#x131;klayal&#x131;m. &#x130;lk sat&#x131;rda asl&#x131;nda yaz&#x131;lar&#x131;m&#x131;z&#x131;n fontunu de&#x11F;i&#x15F;tirdik. <em>body</em> etiketi sayfam&#x131;z&#x131; olu&#x15F;tururken kulland&#x131;&#x11F;&#x131;m&#x131;z di&#x11F;er t&#xFC;m HTML etiketlerini kapsad&#x131;&#x11F;&#x131; i&#xE7;in bu etikette yapaca&#x11F;&#x131;m&#x131;z de&#x11F;i&#x15F;iklikler di&#x11F;er t&#xFC;m etiketlerde de ge&#xE7;erli olacak. &#xD6;zetle HTML ve CSS&apos;de bir hiyerar&#x15F;iden bahsedebiliriz. Bu da demek oluyor ki fontu <em>Helvetica</em> olarak de&#x11F;i&#x15F;tirmemiz t&#xFC;m sayfada fontun de&#x11F;i&#x15F;mesi anlam&#x131;na geliyor.</p>
<p>&#x130;kinci sat&#x131;rda da sat&#x131;rlar&#x131;n boyutunu ayarlad&#x131;k. <em>1.5</em> de&#x11F;eri vererek normal sat&#x131;r y&#xFC;ksekli&#x11F;ini normalinin 1.5 kat&#x131; olarak ayarlam&#x131;&#x15F; olduk. Son sat&#x131;rda da yaz&#x131; rengini griye yak&#x131;n bir renk olan #555 rengi ile de&#x11F;i&#x15F;tirdik. Bir de arka plan rengini d&#xFC;zenleyerek bu k&#x131;s&#x131;mdaki d&#xFC;zenlemelerimizi sonland&#x131;ral&#x131;m. <em>background-color</em> &#xF6;zelli&#x11F;ine de <em>#f2f2f2</em> de&#x11F;erini verelim. </p>
<pre><code class="lang-css"><span class="hljs-selector-tag">body</span> {
      <span class="hljs-attribute">margin</span>: <span class="hljs-number">0</span> auto;
      <span class="hljs-attribute">max-width</span>: <span class="hljs-number">50em</span>;
      <span class="hljs-attribute">padding</span>: <span class="hljs-number">4em</span> <span class="hljs-number">1em</span>;

      <span class="hljs-attribute">font-family</span>: <span class="hljs-string">&quot;Helvetica&quot;</span>, <span class="hljs-string">&quot;Arial&quot;</span>, sans-serif;
    <span class="hljs-attribute">line-height</span>: <span class="hljs-number">1.5</span>;
    <span class="hljs-attribute">color</span>: <span class="hljs-number">#555</span>;

      <span class="hljs-attribute">background-color</span>: <span class="hljs-number">#f2f2f2</span>;
}
</code></pre>
<p>Kodumuzun son hali bu &#x15F;ekilde olacak. E&#x11F;er siz kodunuzu kendiniz yazd&#x131;ysan&#x131;z k&#x131;yaslayabilirsiniz. Tekrar taray&#x131;c&#x131;m&#x131;z &#xFC;zerinden kontrol edelim ve sayfam&#x131;z&#x131;n ilk haliyle &#x15F;imdiki hali aras&#x131;ndaki belirgin fark&#x131; g&#xF6;zetleyelim.</p>
<p>Daha &#xF6;ncesinde hat&#x131;rl&#x131;yorsan&#x131;z sayfam&#x131;za g&#xF6;rsel ekledi&#x11F;imizde g&#xF6;rselimiz abart&#x131; boyutlardayd&#x131;. Tabii bu benim g&#xF6;rselimin boyutlar&#x131;ndan dolay&#x131;yd&#x131;, sizin ekledi&#x11F;iniz foto&#x11F;raf&#x131;n&#x131;z daha k&#xFC;&#xE7;&#xFC;k ve ya b&#xFC;y&#xFC;k olabilir. Ancak biz yine de resimin kaplayabilece&#x11F;i y&#xFC;ksekli&#x11F;i s&#x131;n&#x131;rlarsak standart bir g&#xF6;r&#xFC;n&#xFC;m elde edebiliriz. <em>max-width</em> &#xF6;zelli&#x11F;inin eleman&#x131;n geni&#x15F;li&#x11F;ini s&#x131;n&#x131;rland&#x131;rd&#x131;&#x11F;&#x131;ndan bahsetmi&#x15F;tik. Eleman&#x131;n y&#xFC;ksekli&#x11F;ini s&#x131;n&#x131;rland&#x131;rmak i&#xE7;in de <em>max-height</em> &#xF6;zelli&#x11F;ini kullanaca&#x11F;&#x131;z. G&#xF6;rselimizi <em>img</em> etiketi ile ekledi&#x11F;imiz i&#xE7;in se&#xE7;icisi <em>img</em> etiketi olan yeni bir css kodu haz&#x131;rlayal&#x131;m ve <em>max-height</em> &#xF6;zelli&#x11F;ine <em>150px</em> de&#x11F;erini verelim.</p>
<pre><code class="lang-css"><span class="hljs-selector-tag">img</span> {
    <span class="hljs-attribute">max-height</span>: <span class="hljs-number">200px</span>;
}
</code></pre>
<p>Bu &#x15F;ekilde g&#xF6;r&#xFC;n&#xFC;yor olmal&#x131;. Bu sefer &#xF6;l&#xE7;&#xFC; birimi olarak <strong>px</strong> yani pikselleri kulland&#x131;k. Bu kodlar&#x131;m&#x131;z&#x131; da yine <em>style.css</em> dosyas&#x131; i&#xE7;ine yazmaya devam ediyoruz. Dolay&#x131;s&#x131;yla <em>style.css</em> dosyam&#x131;z&#x131;n son hali a&#x15F;a&#x11F;&#x131;daki gibi bir hal alm&#x131;&#x15F; olmal&#x131;.</p>
<pre><code class="lang-css"><span class="hljs-selector-tag">body</span> {
      <span class="hljs-attribute">margin</span>: <span class="hljs-number">0</span> auto;
      <span class="hljs-attribute">max-width</span>: <span class="hljs-number">50em</span>;
      <span class="hljs-attribute">padding</span>: <span class="hljs-number">4em</span> <span class="hljs-number">1em</span>;

      <span class="hljs-attribute">font-family</span>: <span class="hljs-string">&quot;Helvetica&quot;</span>, <span class="hljs-string">&quot;Arial&quot;</span>, sans-serif;
    <span class="hljs-attribute">line-height</span>: <span class="hljs-number">1.5</span>;
    <span class="hljs-attribute">color</span>: <span class="hljs-number">#555</span>;

      <span class="hljs-attribute">background-color</span>: <span class="hljs-number">#f2f2f2</span>;
}

<span class="hljs-selector-tag">img</span> {
    <span class="hljs-attribute">max-height</span>: <span class="hljs-number">200px</span>;
}
</code></pre>
<p>S&#x131;rada ufak k&#xFC;&#xE7;&#xFC;k dokunu&#x15F;lar&#x131; yapmak kald&#x131;. <em>body</em> etiketinin &#xF6;zelliklerini d&#xFC;zenlerken <em>color</em> &#xF6;zelli&#x11F;ine griye yak&#x131;n bir ton vermi&#x15F;tik. Dolay&#x131;s&#x131;yla sayfam&#x131;zdaki t&#xFC;m yaz&#x131;lar griye yak&#x131;n bir tonda yaz&#x131;yor. Ancak biz ba&#x15F;l&#x131;klar&#x131;n daha koyu hatta siyah olmas&#x131;n&#x131; istiyoruz ki &#xF6;ne &#xE7;&#x131;kabilsin ve genel okunabilirlik arts&#x131;n. Bunun i&#xE7;in ba&#x15F;l&#x131;klara &#xF6;zel bir renk tan&#x131;mlarsak genel renk tan&#x131;mlamas&#x131;n&#x131; ezebiliriz/&#xE7;i&#x11F;neyebiliriz (yani genelge&#xE7;er olan&#x131; yok say&#x131;p &#xF6;zel alan olu&#x15F;turabiliriz) ve istedi&#x11F;imizi elde edebiliriz. Ancak hat&#x131;rlarsan&#x131;z biz HTML kodlar&#x131;m&#x131;z&#x131; haz&#x131;rlarken ba&#x15F;l&#x131;klar&#x131; <em>h1</em> ve <em>h2</em> etiketleri ile olu&#x15F;turmu&#x15F;tuk. Dolay&#x131;s&#x131;yla bu sefer se&#xE7;icimiz iki farkl&#x131; etiketi se&#xE7;ecek. Biz bu etiketleri <em>, (virg&#xFC;l)</em> ile ay&#x131;rarak birden fazla etiketi se&#xE7;meyi sa&#x11F;layabiliyoruz. &#xD6;ncelikle se&#xE7;icimizi haz&#x131;rlayal&#x131;m.</p>
<pre><code class="lang-css"><span class="hljs-selector-tag">h1</span>, <span class="hljs-selector-tag">h2</span>{

}
</code></pre>
<p>Bu &#x15F;ekilde iki farkl&#x131; etiketi se&#xE7;ecek ve yazd&#x131;&#x11F;&#x131;m&#x131;z &#xF6;zelliklerin her ikisi &#xFC;zerinde de uygulanmas&#x131;n&#x131; sa&#x11F;layaca&#x11F;&#x131;z. &#x15E;imdi de <em>color</em> &#xF6;zelli&#x11F;ine <em>black</em> de&#x11F;erini verelim ve ba&#x15F;l&#x131;klarda yaz&#x131;lar&#x131;n siyah olmas&#x131;n&#x131; sa&#x11F;layal&#x131;m.</p>
<pre><code class="lang-css"><span class="hljs-selector-tag">h1</span>, <span class="hljs-selector-tag">h2</span>{
    <span class="hljs-attribute">color</span>: black;
}
</code></pre>
<p>&#x15E;imdi t&#xFC;m dosyay&#x131; kay&#x131;t edelim ve taray&#x131;c&#x131; &#xFC;st&#xFC;nden eserimizi kontrol edelim. K&#x131;sa bir CSS yazarak sayfam&#x131;z&#x131; nas&#x131;l okunabilir hale getirdi&#x11F;imizi g&#xF6;rd&#xFC;k. Tabii ki CSS bu kadar k&#x131;sa s&#xFC;rede kavranabilecek bir &#x15F;ey de&#x11F;il. Biz burada sadece ne oldu&#x11F;u ve nas&#x131;l/ne ama&#xE7;larla kullan&#x131;ld&#x131;&#x11F;&#x131; konular&#x131;nda bilgi sahibi olmay&#x131; hedefliyorduk ve olduk da. <em>style.css</em> sayfam&#x131;z&#x131;n son halini k&#x131;yaslama yapmak isteyenler i&#xE7;in a&#x15F;a&#x11F;&#x131;ya b&#x131;rakal&#x131;m. Renk &#xF6;zelliklerini, bo&#x15F;luk de&#x11F;erlerini kafan&#x131;za g&#xF6;re d&#xFC;zenleyip kendi ki&#x15F;isel dosyan&#x131;z&#x131; olu&#x15F;turmak daha zevkli olacakt&#x131;r. &#xC7;ekinmeyin!</p>
<pre><code class="lang-css"><span class="hljs-selector-tag">body</span> {
      <span class="hljs-attribute">margin</span>: <span class="hljs-number">0</span> auto;
      <span class="hljs-attribute">max-width</span>: <span class="hljs-number">50em</span>;
      <span class="hljs-attribute">padding</span>: <span class="hljs-number">4em</span> <span class="hljs-number">1em</span>;

      <span class="hljs-attribute">font-family</span>: <span class="hljs-string">&quot;Helvetica&quot;</span>, <span class="hljs-string">&quot;Arial&quot;</span>, sans-serif;
    <span class="hljs-attribute">line-height</span>: <span class="hljs-number">1.5</span>;
    <span class="hljs-attribute">color</span>: <span class="hljs-number">#555</span>;

      <span class="hljs-attribute">background-color</span>: <span class="hljs-number">#f2f2f2</span>;
}

<span class="hljs-selector-tag">img</span> {
    <span class="hljs-attribute">max-height</span>: <span class="hljs-number">200px</span>;
}

<span class="hljs-selector-tag">h1</span>, <span class="hljs-selector-tag">h2</span>{
    <span class="hljs-attribute">color</span>: black;
}
</code></pre>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="prepare_html.html" class="navigation navigation-prev " aria-label="Previous page: HTML'i Hazırlayalım">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="retouch.html" class="navigation navigation-next " aria-label="Next page: Son Dokunuşlar">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Görünüşü Güzelleştirelim","level":"1.5.2","depth":2,"next":{"title":"Son Dokunuşlar","level":"1.5.3","depth":2,"path":"4-lets_start/retouch.md","ref":"4-lets_start/retouch.md","articles":[]},"previous":{"title":"HTML'i Hazırlayalım","level":"1.5.1","depth":2,"path":"4-lets_start/prepare_html.md","ref":"4-lets_start/prepare_html.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"root":"source/","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Buğra İŞGÜZAR ben@bisguzar.com","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"language":"tr","gitbook":"*","description":"Bu döküman HTML ve CSS'i uygulamalı olarak öğretme amacı taşır. Dökümanı başarıyla tamamlayanlar kendi amatör websitelerini yapmış olacaklar."},"file":{"path":"4-lets_start/beautify_html.md","mtime":"2019-02-08T19:53:53.921Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-02-08T19:54:37.863Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

