
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Derinlere İnelim · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../3-about_css.html" />
    
    
    <link rel="prev" href="tags.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Giriş
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../1-how_internet_works/content.html">
            
                <a href="../1-how_internet_works/content.html">
            
                    
                    İnternet Nasıl Çalışır
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    HTML'e Giriş
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="tags.html">
            
                <a href="tags.html">
            
                    
                    Temel Etiketler
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.2" data-path="tags2.html">
            
                <a href="tags2.html">
            
                    
                    Derinlere İnelim
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../3-about_css.html">
            
                <a href="../3-about_css.html">
            
                    
                    CSS'e Giriş
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../4-lets_start/begin.html">
            
                <a href="../4-lets_start/begin.html">
            
                    
                    Başlayalım
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../4-lets_start/prepare_html.html">
            
                <a href="../4-lets_start/prepare_html.html">
            
                    
                    HTML'i Hazırlayalım
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../4-lets_start/beautify_html.html">
            
                <a href="../4-lets_start/beautify_html.html">
            
                    
                    Görünüşü Güzelleştirelim
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../4-lets_start/retouch.html">
            
                <a href="../4-lets_start/retouch.html">
            
                    
                    Son Dokunuşlar
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../5-deployment.html">
            
                <a href="../5-deployment.html">
            
                    
                    Sayfamızı Yayınlayalım
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Derinlere İnelim</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="html-etiketleri-devam">HTML Etiketleri (devam)</h1>
<p>Bir &#xF6;nceki k&#x131;s&#x131;mda g&#xF6;rd&#xFC;&#x11F;&#xFC;m&#xFC;z etiketler kullanmam&#x131;z gereken, bir HTML sayfas&#x131;n&#x131;n temelta&#x15F;lar&#x131;n&#x131; olu&#x15F;turan etiketlerdi. Ancak bu sayfada g&#xF6;rece&#x11F;imiz t&#xFC;m etiketler bizim hayal g&#xFC;c&#xFC;m&#xFC;z&#xFC; taray&#x131;c&#x131;ya aktarmam&#x131;z&#x131; sa&#x11F;layacak etiketler. Yani bu etiketleri istedi&#x11F;imiz kombinasyonlarda kullanarak istedi&#x11F;imiz web sayfas&#x131;n&#x131; olu&#x15F;turabiliriz. Ancak tahmin edebilece&#x11F;iniz &#xFC;zere HTML etiketleri buradakiler ile s&#x131;n&#x131;rl&#x131; de&#x11F;il. Biz burada sadece d&#xF6;k&#xFC;man&#x131;n ilerleyen a&#x15F;amalar&#x131;nda i&#x15F;imize yarayacak olanlar&#x131; g&#xF6;rece&#x11F;iz. Di&#x11F;er t&#xFC;m HTML etiketleri i&#xE7;in <a href="https://www.w3schools.com/tags/" target="_blank">w3schools/tags (ingilizce)</a> sayfas&#x131;n&#x131; ziyaret edebilirsiniz.</p>
<h1 id="yaz&#x131;-etiketleri">Yaz&#x131; Etiketleri</h1>
<p>Web sayfalar&#x131; olu&#x15F;tururken her zaman b&#xFC;y&#xFC;l&#xFC; i&#x15F;ler yapan kodlar yazm&#x131;yoruz. Bazen de d&#xFC;z yaz&#x131;lar yazmam&#x131;z gerekiyor ki &#xE7;o&#x11F;u zaman sayfalar&#x131;n temellerini bu d&#xFC;z yaz&#x131;lar olu&#x15F;turuyor. Ve biz yaz&#x131; yazarken baz&#x131; noktalar&#x131; kal&#x131;nla&#x15F;t&#x131;rmak, ba&#x15F;l&#x131;klar olu&#x15F;turmak isteyebiliyoruz. Tam bu noktada &#x15F;imdi g&#xF6;rece&#x11F;imiz etiketlerden yard&#x131;m al&#x131;yoruz. Tam bu noktada hat&#x131;rlatmam gereken bir konu var. D&#xF6;k&#xFC;man&#x131;n HTML&apos;e Giri&#x15F; k&#x131;s&#x131;m&#x131;nda HTML etiketlerinin yap&#x131;s&#x131;ndan bahsetmi&#x15F;tik. Baz&#x131; etiketlerin a&#xE7;&#x131;lmas&#x131; ile kapanmas&#x131; aras&#x131;na de&#x11F;erler girebildi&#x11F;imizi ve bunlara i&#xE7;erik (content) dedi&#x11F;imizi hat&#x131;rl&#x131;yorsan&#x131;z okumaya devam edebilirsiniz.</p>
<h2 id="ba&#x15F;l&#x131;klar">Ba&#x15F;l&#x131;klar</h2>
<p>Asl&#x131;nda ba&#x15F;l&#x131;k olu&#x15F;turmak HTML&apos;de &#xE7;ok basit. Ba&#x15F;l&#x131;k olmas&#x131;n&#x131; istedi&#x11F;imiz yaz&#x131;y&#x131; i&#xE7;erik olarak <code>&lt;h1&gt;</code> etiketine verdi&#x11F;imiz zaman o bizim i&#xE7;in her &#x15F;eyi yap&#x131;yor. Ancak bazen farkl&#x131; boyutlarda ba&#x15F;l&#x131;klar olu&#x15F;turmam&#x131;z gerekebiliyor. Tam bu noktada <code>&lt;hX&gt;</code> &#x15F;eklinde kullanabiliyoruz bu etiketi. X yerine 1 ile 6 dahil olmak &#xFC;zere 1 ile 6 aras&#x131;nda bir rakam girebiliyor ve ba&#x15F;l&#x131;&#x11F;&#x131;n boyutunu belirleyebiliyoruz. Bilmemiz gereken nokta ise rakam ne kadar b&#xFC;y&#xFC;r ise (en fazla 6 olabiliyor) ba&#x15F;l&#x131;&#x11F;&#x131;n o oranda k&#xFC;&#xE7;&#xFC;lece&#x11F;i. Yani ters orant&#x131; var.</p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">h1</span>&gt;</span>Ben h1 ile olu&#x15F;turulmu&#x15F; bir ba&#x15F;l&#x131;&#x11F;&#x131;m<span class="hljs-tag">&lt;/<span class="hljs-name">h1</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">h2</span>&gt;</span>Ben h2 ile olu&#x15F;turulmu&#x15F; bir ba&#x15F;l&#x131;&#x11F;&#x131;m<span class="hljs-tag">&lt;/<span class="hljs-name">h2</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">h3</span>&gt;</span>Ben h3 ile olu&#x15F;turulmu&#x15F; bir ba&#x15F;l&#x131;&#x11F;&#x131;m<span class="hljs-tag">&lt;/<span class="hljs-name">h3</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">h4</span>&gt;</span>Ben h4 ile olu&#x15F;turulmu&#x15F; bir ba&#x15F;l&#x131;&#x11F;&#x131;m<span class="hljs-tag">&lt;/<span class="hljs-name">h4</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">h5</span>&gt;</span>Ben h5 ile olu&#x15F;turulmu&#x15F; bir ba&#x15F;l&#x131;&#x11F;&#x131;m<span class="hljs-tag">&lt;/<span class="hljs-name">h5</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">h6</span>&gt;</span>Ben h6 ile olu&#x15F;turulmu&#x15F; bir ba&#x15F;l&#x131;&#x11F;&#x131;m<span class="hljs-tag">&lt;/<span class="hljs-name">h6</span>&gt;</span>
</code></pre>
<p>Bu &#xF6;rne&#x11F;imizin taray&#x131;c&#x131;da verdi&#x11F;i &#xE7;&#x131;kt&#x131;ya hep beraber bakal&#x131;m.</p>
<p></p><h1 id="ben-h1-ile-olu&#x15F;turulmu&#x15F;-bir-ba&#x15F;l&#x131;&#x11F;&#x131;m">Ben h1 ile olu&#x15F;turulmu&#x15F; bir ba&#x15F;l&#x131;&#x11F;&#x131;m</h1><p></p>
<p></p><h2 id="ben-h2-ile-olu&#x15F;turulmu&#x15F;-bir-ba&#x15F;l&#x131;&#x11F;&#x131;m">Ben h2 ile olu&#x15F;turulmu&#x15F; bir ba&#x15F;l&#x131;&#x11F;&#x131;m</h2><p></p>
<p></p><h3 id="ben-h3-ile-olu&#x15F;turulmu&#x15F;-bir-ba&#x15F;l&#x131;&#x11F;&#x131;m">Ben h3 ile olu&#x15F;turulmu&#x15F; bir ba&#x15F;l&#x131;&#x11F;&#x131;m</h3><p></p>
<p></p><h4 id="ben-h4-ile-olu&#x15F;turulmu&#x15F;-bir-ba&#x15F;l&#x131;&#x11F;&#x131;m">Ben h4 ile olu&#x15F;turulmu&#x15F; bir ba&#x15F;l&#x131;&#x11F;&#x131;m</h4><p></p>
<p></p><h5 id="ben-h5-ile-olu&#x15F;turulmu&#x15F;-bir-ba&#x15F;l&#x131;&#x11F;&#x131;m">Ben h5 ile olu&#x15F;turulmu&#x15F; bir ba&#x15F;l&#x131;&#x11F;&#x131;m</h5><p></p>
<h6 id="ben-h6-ile-olu&#x15F;turulmu&#x15F;-bir-ba&#x15F;l&#x131;&#x11F;&#x131;m">Ben h6 ile olu&#x15F;turulmu&#x15F; bir ba&#x15F;l&#x131;&#x11F;&#x131;m</h6>

<h2 id="kal&#x131;n-yaz&#x131;">Kal&#x131;n Yaz&#x131;</h2>
<p><code>&lt;b&gt;</code> etiketine i&#xE7;erik olarak verdi&#x11F;imiz yaz&#x131; taray&#x131;c&#x131;lar&#x131;m&#x131;z taraf&#x131;ndan normal yaz&#x131;lara k&#x131;yasla daha kal&#x131;n yazd&#x131;r&#x131;lacakt&#x131;r.</p>
<h2 id="paragraflar">Paragraflar</h2>
<p>G&#xFC;nl&#xFC;k hayatta bile yaz&#x131;lar yazarken (&#xF6;zellikle de uzun yaz&#x131;lar) okunabilirli&#x11F;i artt&#x131;rabilmek ad&#x131;na paragraflar halinde yaz&#x131;yoruz. HTML&apos;de de paragraflar olu&#x15F;turmak i&#xE7;in <code>&lt;p&gt;</code> etiketinden yararlan&#x131;yoruz. Her paragraf&#x131; <strong>p</strong> etiketi i&#xE7;inde yazaca&#x11F;&#x131;z. B&#xF6;ylelikler daha sonra CSS ile bi&#xE7;imlendirirken i&#x15F;imiz kolay olacak.</p>
<h1 id="resimg&#xF6;rsel">Resim/G&#xF6;rsel</h1>
<p>Sayfam&#x131;z sadece yaz&#x131;lardan olu&#x15F;muyor. Bir &#xE7;ok zaman resimlerden de yard&#x131;m al&#x131;yoruz. Bu noktada <code>&lt;img&gt;</code> etiketi bizim yard&#x131;m&#x131;m&#x131;za ko&#x15F;uyor. HTML&apos;de etiketlerin kapat&#x131;lmas&#x131; gerekti&#x11F;inden bahsetmi&#x15F;tik. Ancak baz&#x131; istisna etiketlerimiz de yok de&#x11F;il. &#xD6;rne&#x11F;in <strong>img</strong> etiketimizi a&#xE7;&#x131;yoruz ancak kapatm&#x131;yoruz. &#xC7;&#xFC;nk&#xFC; bu etiket i&#xE7;erik (content) olarak bir de&#x11F;er alm&#x131;yor ve dolay&#x131;s&#x131;yla kapat&#x131;lmas&#x131;na da gerek olmuyor. Yani bir kapsama alan&#x131; yok, kendisi bir i&#x15F;lemi ger&#xE7;ekle&#x15F;tiriyor sadece diyebiliriz.</p>
<p><em>HTML&apos;e Giri&#x15F;</em> k&#x131;s&#x131;m&#x131;nda baz&#x131; etiketlerin nitelikler alabildi&#x11F;inden bahsetmi&#x15F;tik. Bu etiketlerden biri <code>&lt;img&gt;</code> etiketi. Bu etikete <strong>src</strong> ad&#x131;nda bir nitelik ile de&#x11F;er olarak g&#xF6;rselim adresini veriyoruz ve o g&#xF6;rseli sayfam&#x131;za eklemi&#x15F; oluyoruz. Adres olarak g&#xF6;rselin internet &#xFC;zerindeki bir adresini verebilece&#x11F;imiz gibi e&#x11F;er HTML sayfam&#x131;z ile eri&#x15F;ebilecek bir konumdaysa dosya yolunu da verebiliriz. &#xD6;rne&#x11F;in test.html sayfam&#x131;z ve test.png dosyam&#x131;z ayn&#x131; klas&#xF6;rde olsunlar. Biz HTML sayfam&#x131;z i&#xE7;inde <img src="test.png">` kodumuzu yazarsak yine g&#xF6;rsel sayfam&#x131;za eklenmi&#x15F; olacak.</p>
<h1 id="a-etiketi"><code>&lt;a&gt;</code> etiketi</h1>
<p><code>&lt;a&gt;</code> etiketi ile farkl&#x131; bir etikete ya da bir yaz&#x131;ya ba&#x11F;lant&#x131; &#xF6;zelli&#x11F;i verebiliyoruz. HTML&apos;de nitelik alabilen bir di&#x11F;er etiket de <strong>a</strong> etiketimiz. Kendisine <strong>href</strong> niteli&#x11F;i ile birlikte de&#x11F;er olarak ba&#x11F;lant&#x131; adresini veriyoruz.</p>
<pre><code class="lang-html">    <span class="hljs-tag">&lt;<span class="hljs-name">a</span> <span class="hljs-attr">href</span>=<span class="hljs-string">&quot;www.twitter.com/kodlamag&quot;</span>&gt;</span> @kodlamag <span class="hljs-tag">&lt;/<span class="hljs-name">a</span>&gt;</span>
</code></pre>
<p>&#xD6;rne&#x11F;imizi bir HTML dosyas&#x131; olarak kaydedip herhangi bir taray&#x131;c&#x131; ile a&#xE7;arsak mavi renkte <strong>@kodlamag</strong> yazd&#x131;&#x11F;&#x131;n&#x131; ve bu yaz&#x131;ya t&#x131;klad&#x131;&#x11F;&#x131;m&#x131;zda ilgili Twitter adresinin a&#xE7;&#x131;ld&#x131;&#x11F;&#x131;n&#x131; g&#xF6;rebilirsiniz. Ayr&#x131;ca farkl&#x131; etiketlere de ba&#x11F;lant&#x131; verebildi&#x11F;imizden bahsetmi&#x15F;tik. <strong>a</strong> etiketine i&#xE7;erik olarak farkl&#x131; bir etiket (&#xF6;rne&#x11F;in <strong>img</strong> etiketi ile bir g&#xF6;rsel) verirseniz verdi&#x11F;iniz etiketin &#xE7;&#x131;kt&#x131;s&#x131; da t&#x131;klanabilir olacakt&#x131;r.</p>
<h1 id="br-etiketi"><code>&lt;br&gt;</code> etiketi</h1>
<p>Baz&#x131; durumlarda bir alt sat&#x131;ra ge&#xE7;memiz gerekebiliyor. Bu durumda <code>&lt;br&gt;</code> etiketini kullan&#x131;yoruz. Bu etiket de <em>img</em> etiketi gibi kapat&#x131;lmaya gerek duyulmayan etiketlerden.</p>
<h1 id="b&#xF6;l&#xFC;mler">B&#xF6;l&#xFC;mler</h1>
<p>Web sayfalar&#x131;m&#x131;z&#x131; yekpare olu&#x15F;turmuyoruz. &#xD6;rne&#x11F;in &#xE7;o&#x11F;u web sayfas&#x131;n&#x131;n &#xFC;st k&#x131;sm&#x131;nda bir men&#xFC; b&#xF6;l&#xFC;m&#xFC;, onun alt&#x131;nda i&#xE7;erik b&#xF6;l&#xFC;m&#xFC;, (e&#x11F;er var ise) yan k&#x131;s&#x131;m&#x131;nda ek detaylar b&#xF6;l&#xFC;m&#xFC; ve en altta da bir altbilgi b&#xF6;l&#xFC;m&#xFC; g&#xF6;r&#xFC;yoruz. Bunlar&#x131;n her biri bir b&#xF6;l&#xFC;m olarak de&#x11F;erlendirilebilir.</p>
<p>HTML&apos;de baz&#x131; yap&#x131;lar&#x131; b&#xF6;l&#xFC;mlere ay&#x131;rmam&#x131;z gerekiyor. &#x130;leride CSS&apos;ye giri&#x15F; yapt&#x131;&#x11F;&#x131;m&#x131;zda daha iyi anlayaca&#x11F;&#x131;z bu durumu. Tam bu noktada <code>&lt;div&gt;</code> etiketi yard&#x131;m&#x131;m&#x131;za ko&#x15F;uyor. <strong>Div</strong> etiketi bir konteyner olu&#x15F;turuyor ve kendisine verdi&#x11F;imiz i&#xE7;eri&#x11F;i bu konteyner&#x131;n i&#xE7;ine koyuyor diye d&#xFC;&#x15F;&#xFC;nebilirsiniz. Kendisinin alabildi&#x11F;i niteliklere daha sonra de&#x11F;inece&#x11F;iz.</p>
<p>Ancak g&#xFC;n&#xFC;m&#xFC;zde bu i&#x15F; biraz daha karma&#x15F;&#x131;k bir h&#xE2;l ald&#x131;(!). <strong>HTML5</strong> ile birlikte gelen &#xF6;zelliklerden biri de isim olarak daha spesifik etiketler. &#xD6;rne&#x11F;in art&#x131;k men&#xFC; olu&#x15F;tururken <em>div</em> etiketi yerine <em>nav</em> etiketini kullan&#x131;yoruz. Kendisini yine bir div olarak d&#xFC;&#x15F;&#xFC;nebiliriz. Ancak ismi daha &#xF6;zel ve sayfam&#x131;z&#x131;n kodlar&#x131;n&#x131; daha okunabilir yap&#x131;yor. Buna benzer HTML5 ile beraber eklenen di&#x11F;er etiketleri de listeleyelim.</p>
<ul>
<li><code>&lt;article&gt;</code></li>
<li><code>&lt;aside&gt;</code></li>
<li><code>&lt;details&gt;</code></li>
<li><code>&lt;figcaption&gt;</code></li>
<li><code>&lt;figure&gt;</code></li>
<li><code>&lt;footer&gt;</code></li>
<li><code>&lt;header&gt;</code></li>
<li><code>&lt;main&gt;</code></li>
<li><code>&lt;mark&gt;</code></li>
<li><code>&lt;nav&gt;</code></li>
<li><code>&lt;section&gt;</code></li>
<li><code>&lt;summary&gt;</code></li>
<li><code>&lt;time&gt;</code></li>
</ul>
<p>&#xD6;zetle bu etiketler <em>div</em> etiketinin daha insanc&#x131;l/okunabilir hali ve bir i&#x15F;i yapmak i&#xE7;in &#xF6;zelle&#x15F;tirilmi&#x15F; halidir diyebiliriz.</p>
<h1 id="listeleme">Listeleme</h1>
<p>HTML&apos;de liste olu&#x15F;turman&#x131;n birka&#xE7; farkl&#x131; yolu var roma rakamlar&#x131;yla listeleme, harfler ile listeleme, latin rakamlar&#x131;yla listeleme ve noktalar ile listeleme. Biz &#x15F;imdilik noktalar &#x15F;eklinde yani madde madde listeleme ile ilgileniyoruz. Liste olu&#x15F;tururken bundan &#xF6;nce &#xF6;&#x11F;rendiklerimizden farkl&#x131; olarak birden fazla etiket kullanaca&#x11F;&#x131;z. <code>&lt;ul&gt;</code> ve <code>&lt;li&gt;</code> etiketleri liste olu&#x15F;turmam&#x131;zda bize yard&#x131;mc&#x131; olacak. </p>
<p><code>&lt;ul&gt;</code> etiketi ile &#xF6;ncelikle listemizi ba&#x15F;lataca&#x11F;&#x131;z ve daha sonras&#x131;nda her bir liste eleman&#x131; i&#xE7;in <code>&lt;li&gt;</code> etiketini kullanaca&#x11F;&#x131;z. Baz&#x131; b&#xFC;y&#xFC;k&#x15F;ehirleri i&#xE7;eren bir liste olu&#x15F;tural&#x131;m ve &#xF6;rnek &#xFC;zerinden ilerleyelim.</p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">ul</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">li</span>&gt;</span>&#x130;stanbul<span class="hljs-tag">&lt;/<span class="hljs-name">li</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">li</span>&gt;</span>Ankara<span class="hljs-tag">&lt;/<span class="hljs-name">li</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">li</span>&gt;</span>&#x130;zmir<span class="hljs-tag">&lt;/<span class="hljs-name">li</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">li</span>&gt;</span>Bal&#x131;kesir<span class="hljs-tag">&lt;/<span class="hljs-name">li</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">li</span>&gt;</span>Kocaeli<span class="hljs-tag">&lt;/<span class="hljs-name">li</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">ul</span>&gt;</span>
</code></pre>
<p>G&#xF6;rd&#xFC;&#x11F;&#xFC;n&#xFC;z gibi her bir maddeyi <code>&lt;li&gt;</code> etiketlerine i&#xE7;erik olarak vererek elemanlar olu&#x15F;turduk. Ve bu elemanlar&#x131; da <code>&lt;ul&gt;</code> etiketine i&#xE7;erik olarak verdik. Burada listeyi olu&#x15F;turan etiketimiz <em>ul</em> etiketi, <em>li</em> etiketi ise liste elemanlar&#x131;n&#x131; belirtiyor. &#x15E;imdi bu kodun taray&#x131;c&#x131;da verece&#x11F;i &#xE7;&#x131;kt&#x131;ya bakal&#x131;m.</p>
<ul>
    <li>&#x130;stanbul</li>
    <li>Ankara</li>
    <li>&#x130;zmir</li>
    <li>Bal&#x131;kesir</li>
    <li>Kocaeli</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="tags.html" class="navigation navigation-prev " aria-label="Previous page: Temel Etiketler">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../3-about_css.html" class="navigation navigation-next " aria-label="Next page: CSS'e Giriş">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Derinlere İnelim","level":"1.3.2","depth":2,"next":{"title":"CSS'e Giriş","level":"1.4","depth":1,"path":"3-about_css.md","ref":"3-about_css.md","articles":[]},"previous":{"title":"Temel Etiketler","level":"1.3.1","depth":2,"path":"2-about_html/tags.md","ref":"2-about_html/tags.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"2-about_html/tags2.md","mtime":"2019-02-05T11:37:05.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-02-05T11:50:11.644Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

